clc;
clear all;
close all;

T = 0.01;
F=[1 0 T 0; 0 1 0 T; 0 0 1 0; 0 0 0 1]; %状态转移矩阵
Q=[0.4 0 0 0; 0 0.4 0 0; 0 0 0.0001 0; 0 0 0 0.0001]; %状态转移协方差矩阵
H=[1 0 0 0 ; 0 1 0 0; 0 0 1 0; 0 0 0 1]; %观测矩阵
R=[0.5^2 0 0 0 ; 0 0.5^2 0 0; 0 0 0.0001 0; 0 0 0 0.0001]; %观测噪声方差
P=[1 0 0 0; 0 1 0 0 ; 0 0 1 0; 0 0 0 1]; %状态协方差矩阵

X=[200;2000;10;20]; %状态
Z(:,1)= H*X(:,1)+sqrtm(R)*rand(4,1);
for i=2:100  
    X(:,i)= F*X(:,i-1)+sqrtm(Q)*rand(4,1); %模拟，产生目标运动真实轨迹
    Z(:,i)= H*X(:,i)+sqrtm(R)*rand(4,1);     %测量值加上噪声
end

X1 = X(:,1);
aa(:,1) = X1;
for i=1:100
    [x,p] = kf(F,X(:,i),P,H,Z(:,i),Q,R);
    aa(:,i) = x;
end

figure;
hold on;
plot(X(1,:),X(2,:),'-b.'); 
hold on;
plot(aa(1,:),aa(2,:),'-r.'); 
hold on;
% plot(Z(1,:),Z(2,:),'-g.'); 
% legend('实际值','测量值','滤波值')
xlabel('x(m)');
ylabel('y(m)')
