function [ MMX0 ] = Jerk_f( sigmar,sigmaj,alpha,T,MX0 )
%UNTITLED2 Summary of this function goes here
%   该函数的目的是利用jerk模型算法对机动目标进行跟踪
%%%参数意义如下：MMX0，输出目标状态
%%%             sigmar，目标位置标准差
%%%             sigmaj，目标加加速度标准差
%%%             alpha，自相关时间常数
%%%             T，雷达采样时间间隔
%%%             MX0，目标位置量测值
%%
NN=length(MX0(1,:));%信号长度
%%%%%%%%%%参数初始化%%%%%%%%%
MMX0=zeros(8,NN);
%%%利用前三次量测值进行初始化
MMX0(1,1)=MX0(1,1);
MMX0(1,2)=MX0(1,2);
MMX0(1,3)=MX0(1,3);
MMX0(2,2)=(MX0(1,2)-MX0(1,1))/T;
MMX0(2,3)=(MX0(1,3)-MX0(1,2))/T;
MMX0(3,3)=(MX0(1,3)-2*MX0(1,2)+MX0(1,1))/T;
MMX0(5,1)=MX0(2,1);
MMX0(5,2)=MX0(2,2);
MMX0(5,3)=MX0(2,3);
MMX0(6,2)=(MX0(2,2)-MX0(2,1))/T;
MMX0(6,3)=(MX0(2,3)-MX0(2,2))/T;
MMX0(7,3)=(MX0(2,3)-2*MX0(2,2)+MX0(2,1))/T;
%%%%%%%%%%%%%%%%%%%%
F1=[1 T T^2/2 T^3/6;0 1 T T^2/2;0 0 1 T;0 0 0 1];
F=[F1 zeros(4);zeros(4) F1];%%%状态矩阵
H=[1 0 0 0 0 0 0 0;
    0 0 0 0 1 0 0 0];%%%测量矩阵
Q1=2*alpha*sigmaj^2*[T^7/252 T^6/72 T^5/30 T^4/24;
                    T^6/72 T^5/20 T^4/8 T^3/6;
    T^5/30 T^4/8 T^3/3 T^2/2;T^4/24 T^3/6 T^2/2 T];
Q=[Q1 zeros(4);zeros(4) Q1];%%%过程噪声协方差
R=sigmar^2*eye(2);
P0=zeros(4,4);
P0(1,1)=R(1,1);
P0(1,2)=R(1,1)/T;
P0(1,3)=R(1,1)/T^2;
P0(2,1)=P0(1,2);
P0(2,2)=2*R(1,1)/T^2;
P0(2,3)=3*R(1,1)/T^3;
P0(2,4)=5/6*sigmaj^2*T^2;
P0(3,1)=P0(1,3);
P0(3,2)=P0(2,3);
P0(3,3)=6*R(1,1)/T^4;
P0(3,4)=sigmaj^2*T;
P0(4,2)=P0(2,4);
P0(4,3)=P0(3,4);
P0(4,4)=sigmaj^2;
P=[P0,zeros(4);
    zeros(4),P0];%%%初始化信息协方差
%%%%%%%%%%%%%%%%%%%%%%%
X=MMX0(:,3);
%%
%%%%%卡尔曼滤波%%%%%%%
for k=4:NN
    X1=F*X;
    Z1=H*X1;
    P1=F*P*F'+Q;
    S=H*P1*H'+R;
    V=MX0(:,k)-Z1;
    W=P1*H'*inv(S);
    X=X1+W*V;
    P=P1-W*S*W';
    MMX0(:,k)=X;
end

end

